In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"economics.csv")

In [5]:
df.head()

         date    pce     pop  psavert  uempmed  unemploy
0  1967-07-01  507.4  198712     12.5      4.5      2944
1  1967-08-01  510.5  198911     12.5      4.7      2945
2  1967-09-01  516.3  199113     11.7      4.6      2958
3  1967-10-01  512.9  199311     12.5      4.9      3143
4  1967-11-01  518.1  199498     12.5      4.7      3066

In [ ]:
df.tail()

           date      pce     pop  psavert  uempmed  unemploy
572  2015-03-01  12161.5  320707      5.2     12.2      8575
573  2015-04-01  12158.9  320887      5.6     11.7      8549

### Exporting Data

In [8]:
df.to_csv("clean_data.csv")

### Column Selection & Filtering

In [ ]:
df['unemploy']

0    2944
1    2945
2    2958
3    3143
4    3066
Name: unemploy, dtype: int64

In [16]:
df[["date","pce"]]

           date      pce
0    1967-07-01    507.4
1    1967-08-01    510.5
2    1967-09-01    516.3
3    1967-10-01    512.9
4    1967-11-01    518.1
..          ...      ...
569  2014-12-01  12122.0
570  2015-01-01  12080.8
571  2015-02-01  12095.9
572  2015-03-01  12161.5
573  2015-04-01  12158.9

[574 rows x 2 columns]

In [27]:
df[df["psavert"] < 10].head()

           date     pce     pop  psavert  uempmed  unemploy
19   1969-02-01   589.5  201881      9.4      4.9      2692
20   1969-03-01   589.7  202023      9.9      4.0      2712
21   1969-04-01   594.7  202161      9.5      4.0      2758
113  1976-12-01  1214.1  219006      9.9      8.0      7545
114  1977-01-01  1217.4  219179      9.8      7.5      7280

In [29]:
df.loc[1:4,"data":"psavert"]

         date    pce     pop  psavert
1  1967-08-01  510.5  198911     12.5
2  1967-09-01  516.3  199113     11.7
3  1967-10-01  512.9  199311     12.5
4  1967-11-01  518.1  199498     12.5

### Handling Missing Values

In [30]:
df.isna()

      date    pce    pop  psavert  uempmed  unemploy
0    False  False  False    False    False     False
1    False  False  False    False    False     False
2    False  False  False    False    False     False
3    False  False  False    False    False     False
4    False  False  False    False    False     False
..     ...    ...    ...      ...      ...       ...
569  False  False  False    False    False     False
570  False  False  False    False    False     False
571  False  False  False    False    False     False
572  False  False  False    False    False     False
573  False  False  False    False    False     False

[574 rows x 6 columns]

In [ ]:
df.notna().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 574 entries, 0 to 573
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      574 non-null    bool
 1   pce       574 non-null    bool
 2   pop       574 non-null    bool
 3   psavert   574 non-null    bool
 4   uempmed   574 non-null    bool
 5   unemploy  574 non-null    bool
dtypes: bool(6)
memory usage: 3.5 KB